{
  "english": {
    "frame": {
  "title": "tinyCTF",
  "toggle": "Toggle navigation",
  "login": "Sign in",
  "register": "Register",
  "logged_in": "Logged in as",
  "logout": "log out"
    },
    "main": {
  "title": "Hello World!",
  "text": "Welcome text goes here"
    },
    "about": {
  "title": "About",
  "news": "News",
  "news_text": "News go here",
  "rules": "Rules",
  "rules_text": "Rules go here"
    },
    "tasks": {
  "title": "Tasks"
    },
    "task": {
  "description": "Description",
  "attachment": "Attachment",
  "submit": "Submit",
  "success": "Correct flag!",
  "failure": "Incorrect flag",
  "points_format": "%d points",
  "solution_format": "solved by %d",
  "no_description": "(none)",
  "placeholder": "Flag goes here"
    },
    "addcat" : {
  "add_title": "Add a Category",
  "edit_title": "Edit a Category",
  "delete_title": "Delete a Category",
  "delete_desc": "Are you sure you want to delete this category?",
  "name_label": "Category Name: "
    },
    "addtask" : {
  "add_title": "Add a Task",
  "edit_title": "Edit a Task",
  "delete_title": "Delete task",
  "delete_desc": "Are you sure you want to delete this task?",
  "cat_label": "Category: ",
  "name_label": "Task Name: ",
  "description_label": "Description: ",
  "flag_label": "Flag: ",
  "score_label": "Score: "
    },
    "scoreboard": {
  "title": "Scoreboard",
  "player": "Player",
  "score": "Score"
    },
    "settings": {
  "title": "Settings",
  "old_pw": "Current Password:",
  "new_pw": "New Password:",
  "email": "Email:"
    },
    "error": {
  "title": "Error",
  "unknown": "Unknown error",
  "login_required": "You need to be logged in to see this page",
  "admin_required": "You need to be an admin to see this page",
  "invalid_credentials": "Invalid username or password",
  "invalid_password": "The password you entered does not match your current password",
  "already_registered": "This user is already registered",
  "empty_user": "Empty username is not allowed",
  "task_not_found": "TBD",
  "bad_request": "Not all required parameters are passed. Please fill ALL fields in form",
  "form": "Invalid form input",
  "not_started": "Competition hasn't started yet"


    }
  },
  "russian": {
    "frame": {
  "title": "СибГУТИ CTF 2016",
  "toggle": "Переключить навигацию",
  "login": "Вход",
  "register": "Регистрация",
  "logged_in": "Вы вошли как",
  "logout": "Выйти"
    },
    "main": {
  "title": "Добро пожаловать на СибГУТИ CTF 2016",
  "text": "<div class='container' style='text-align: left; margin: 5px;'>\r\n<div class='row'>\r\n<p><b>СибГУТИ CTF 2016</b> - это соревнования среди студентов университета СибГУТИ и приглашённых команд Новосибирска в области информационной безопасности (CTF).</p>\r\n  <p>\r\n   <ul>\r\n    <li>Название: SibSUTIS CTF 2016 - командные соревнования по компьютерной безопасности в формате CTF среди студентов города Новосибирска</li>\r\n<li>Лозунг: CTF - НУЖНО ЧТО-ТО МЕНЯТЬ!</li>\r\n<li>Дата закрытия регистрации: 17.11.2016</li>\r\n    <li>Дата проведения соревнований: 19.11.2016</li>\r\n    <li>Место проведения: город Новосибирск, ул.Кирова, 86</li>\r\n    <li>Формат: task-based + attack-defense</li>\r\n    <li>Количество человек в команде: до 7</li>\r\n    <li>Организаторы: команда Life</li>\r\n   </ul>\r\n  </p>\r\n  <p>Впервые в Новосибирске! Мы объединили два формата - <b>jeopardy</b> и <b>classic</b>!</p>\r\n  <p>Новые таски. Новые сервисы. Новые противники</p>\r\n  <p>также после окончания соревнований будет проведен разбор заданий местной командой организаторов.</p>\r\n  <p> </p>\r\n  <p><h4>What is CTF?</h4></p>\r\n  <p><b>CTF (Capture the flag)</b> – это командная игра, главной целью которой является захват «флага» у соперника. Формат Сapture the flag может использоваться и в пейнтболе, и среди ролевиков, и в компьютерных играх. В области компьютерной безопасности тоже есть своё понятие CTF. Командные соревнования по информационной безопасности формата CTF – это как раз то, что стало причиной появления тысяч команд со всего мира и то, ради чего создана эта лента.</p>\r\n\r\n  <p>Соревнования формата CTF могут проходить удалённо (в сети) и очно. В первом случае команды соревнуются через интернет, находясь в разных точках мира. Такие соревнования чаще всего длятся больше суток в формате нон-стоп. На очных соревнованиях команды собираются в одном месте каждая за своим столом. Такие соревнования длятся семь – восемь часов. Часто практикуется совмещение форматов: например, отборочные этапы на некоторые СTF-соревнования проходят в сети, а финал – очно в городе организаторов соревнований. Победа в отборочном туре онлайн даёт команде право участвовать на очном этапе соревнований.</p>\r\n\r\n  <p>Есть несколько вариантов проведения соревнований по компьютерной безопасности. Во-первых, это формат <b>task-based</b> (или <b>jeopardy</b>) – когда игрокам предоставляется набор тасков (заданий), к которым требуется найти ответ и отправить его. Ответ представляет собой флаг: это может быть набор символов или произвольная фраза. За верно выполненное задание команда получает определенное количество очков. Чем задание сложнее, тем больше очков будет полагаться за правильный ответ. Все задания в CTF-соревнованиях формата task-based можно разделить на несколько категорий: например, это задачи на администрирование, криптографию и стеганографию, задачи на нахождение веб-уязвимостей и любимые многими задания категории joy – развлекательные задачи разнообразной тематики. Одно из любимых сегодня заданий категории joy – сделать коллективное селфи. И это с большим успехом выполняется на многих соревнованиях СTF!</p>\r\n\r\n  <p>Второй вариант проведения CTF-соревнования – формат <b>classic</b>. В классической схеме каждая команда получает выделенный сервер или небольшую сеть для поддержания её функционирования и защиты. Во время игры команды получают очки за корректную работу сервисов своего сервера и за украденную информацию (она же – «флаги») с серверов соперников.</p>\r\n\r\n    </div>\r\n    </div>"
    },
    "about": {
  "title": "Основная информация",
  "news": "Последние новости",
  "news_text": "<p><b>28.10.2016:</b> Открыта регистрация. Внимание! Подавшие на участие заявку команды подтверждаются только организаторами</p>",
  "rules": "Правила",
  "rules_text": "<h4>Участие</h4> <p>Участвуют команды от СибГУТИ и вузов Новосибирска: студенты IT-специальностей или других технических специальностей. Максимальное количество человек в команде - 7.<b> Аспиранты не могут входить в команду в качестве игроков.</b> </p> <p> Соревнования проходят в городе Новосибирск, на территории СибГУТИ (Кирова, 86)</p> <p>Для участия в соревнованиях необходимо зарегистрировать команду, корректно указав все данные регистрационной формы. </p> <h4>Организация и проведение</h4> <p>Соревнования SibSUTIS CTF 2016 проходят в формате jeopardy. Команды выполняют задания и получают баллы. Цель - набрать больше всех баллов. </p> <p>Задания могут относится к одной из следующих категорий: </p><ul> <li><b>Crypto</b> - криптографические задачи;</li> <li><b>Stegano</b> – задачи по стеганографии;</li> <li><b>PPC</b> - задачи на программирование (professional programming and coding);</li> <li><b>Reverse</b> – задачи в области обратной разработки и исследованию программ;</li> <li><b>Web</b> – задачи на веб-уязвимости;</li> <li><b>Recon</b> – задачи по сбору и аналитической обработке общедоступной информации;</li> </li></ul>  <p></p> <p>Допускается отсутствие заданий по одной или нескольким категорий, а также включение дополнительной категории заданий. </p> <p>Каждая категория состоит из 3-5 заданий, расположенных по увеличению сложности. В зависимости от уровня сложности за решение дается от 100 до 500 баллов. Техническая комиссия может открыть задание по своему усмотрению в любой момент соревнования, сообщая командам не менее чем за 5 минут. Об открытии задания команды должны узнать одновременно. За правильное решение команда получает символьную строку (флаг), которую отправляет на проверяющую систему. Все задания, а также информационные системы поддержки сервисов и проверки решений разрабатывает техническая комиссия и до начала соревнования держит их в тайне. <br><br>Длительность Соревнований определяется рабочей программой, но не может превышать 7 часов. Конфигурация компьютеров участников и список допустимых языков программирования может быть ограничен техническим регламентом. Техническая комиссия проверяет задания во время соревнований и составляет таблицу результатов, по которой видно количество баллов и рейтинг команд. Команды могут использовать любое количество компьютеров и сетевого оборудования не выше второго уровня OSI (сетевые порты поддерживают один MAC-адрес, в противном случае они переходят в состояние down-link). Во время соревнований участники могут общаться только с членами своей команды и с представителями технической комиссии. </p>  <p> <b>Командам запрещается:</b> </p><ul>   <li>проводить атаки на серверы жюри и автоматизированную систему поддержки сервисов и проверки решений;</li>   <li>проводить фильтрацию команд-противников по IP-адресам или любым другим способом;</li>   <li>генерировать неоправданно большой объем трафика;</li>   <li>проводить DoS-атаки с генерацией большого объема трафика;</li>   <li>мешать другим командам получить флаг;</li>   <li>сообщать условия задач и флаги, кому-либо, за исключением членов своей команды;</li>   <li>использовать виртуальные частные сети (VPN);   </li><li>привлекать к решению задач сторонних лиц. </li></ul> <b>Тренерам команд запрещается присутствовать в аудитории, в которой размещена команда.</b><br>  За нарушение приведенных пунктов или нарушение хода соревнования другим способом (например, неподобающее поведение, подключение и отключение дополнительного оборудования и проводов) команду могут дисквалифицировать. <p></p>  <h4>Апелляция</h4> <p> Если участники не согласны с предварительными результатами, можно подать апелляцию в жюри до оглашения окончательных результатов. Апелляцию можно подать на задания, проверяемые не автоматическим способом.  После апелляции, неккоректные задания исправляют или удаляют, если их невозможно исправить. Жюри пересчитывает баллы, которые и станут официальными результатами соревнования. По результатам апелляции могут измениться количество набранных баллов, рейтинг команд и победители. Жюри оглашает результаты апелляций до итоговых результатов соревнования. </p>  <h4>Подведение итогов</h4> <p> После анализа и утверждения набранных баллов жюри объявляет победителя - команду с наибольшим колличеством баллов,и команды, занявшие второе и третье место. Если несколько команд набрали одинаковое колличество баллов, то выше классифицируется команда, у которой меньше суммарное время выполнения заданий. Жюри может определить победителей по отдельным номинациям (при необходимости). Каждый член команды получает сертификат участника соревнований. Команды, занявшие первые три места, награждаются дипломами первой, второй и третье степени соответсвенно, а также подарками. Победителям присваивается звание <b>«Лучшая команда Соревнований SibSUTIS CTF 2016»</b>. </p> <p> </p>"
    },
    "tasks": {
  "title": "Таски"
    },
    "task": {
  "description": "Описание",
  "attachment": "Вложение",
  "submit": "Отправить",
  "success": "Верный флаг!",
  "failure": "Некорректный флаг",
  "points_format": "%d очков",
  "solution_format": "решено %d",
  "no_description": "(none)",
  "placeholder": "Здесь будет флаг",
  "author": "Автор",
  "hint": "Подсказки",
  "solve": "Решение"
    },
    "addcat" : {
  "add_title": "Добавить категорию",
  "edit_title": "Изменить категорию",
  "delete_title": "Удалить категорию",
  "delete_desc": "Вы действительно хотите удалить эту категорию?",
  "name_label": "Имя категории: "
    },
    "addtask" : {
  "add_title": "Добавить таск",
  "edit_title": "Изменить таск",
  "delete_title": "Удалить таск",
  "delete_desc": "Вы действительно хотите удалить этот таск?",
  "cat_label": "Категория: ",
  "name_label": "Название таска: ",
  "description_label": "Описание: ",
  "flag_label": "Флаг: ",
  "hints_label": "Подсказки: ",
  "author_label": "Автор: ",
  "score_label": "Стоимость: ",
  "solve_label": "Решение: "
    },
    "scoreboard": {
  "title": "Рейтинговая таблица",
  "player": "Команда",
  "affilation": "Представительство",
  "score": "Очки"
    },
    "settings": {
  "title": "Настройки",
  "old_pw": "Текущий пароль:",
  "new_pw": "Новый пароль:",
  "email": "Email:"
    },
    "error": {
  "title": "Ошибка",
  "unknown": "Неизвестная ошибка",
  "login_required": "Для просмотра этой страницы требуется авторизация",
  "admin_required": "Для просмотра этой страницы нужно быть администратором",
  "invalid_credentials": "Некорректное имя и/или пароль",
  "invalid_password": "Пароль, который вы ввели, не должен совпадать с текущим паролем",
  "already_registered": "Команда с таким именем уже зарегистрирована",
  "empty_user": "Пустое название команды недопустимо",
  "task_not_found": "TBD",
  "bad_request": "Вы ввели не все необходимые параметры. Попробуйте ещё раз",
  "form": "Invalid form input",
  "not_started": "Турнир ещё не начался"
    }
  }
}
